In [1]:
import pandas as pd
import numpy as np

team_file = "~/src/baseball-lahman/baseballdatabank-master/core/teams.csv"

tf = pd.read_csv(team_file)
tf

FileNotFoundError: [Errno 2] File /Users/bruceberk/src/baseball-lahman/baseballdatabank-master/core/teams.csv does not exist: '/Users/bruceberk/src/baseball-lahman/baseballdatabank-master/core/teams.csv'

In [ ]:
tf.yearID

In [ ]:
tf['yearID']

In [ ]:
tf70 = tf[tf['yearID'] >= 1970]
tf70

In [ ]:
# using iloc to subset rows and columns using numbers
tf70.iloc[[2,3,4], [0,1,2,3,4,5,8,9]]

In [ ]:
# slicing rows
tf70[:5]

In [ ]:
# columns by name
tf70[['yearID', 'name', 'W', 'L']]

In [ ]:
# slicing with a boolean array
tf70[tf70['W'] >= 90]

In [ ]:
# all rows, select columns
tf70.loc[:, ['yearID', 'teamID', 'W', 'L']]

In [ ]:
tf70.loc[1543, ['yearID', 'teamID', 'W', 'L']]

In [ ]:
tf70.loc[[1543, 1544, 1545], ['yearID', 'teamID', 'W', 'L']]

In [2]:
# arithmetic between data frame and series
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                     columns=list('bde'),
                     index=['Utah','Ohio','Texas','Oregon'])

In [3]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [4]:
series = frame.iloc[0]

In [5]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [6]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [7]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [8]:
series2

b    0
e    1
f    2
dtype: int64

In [9]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [10]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [11]:
# broadcast the operation over the columns, use the methods
series3 = frame['d']

In [12]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [13]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [14]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [15]:
#Numpy's ufuncs work in pandas
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [16]:
frame

               b         d         e
Utah   -0.308471 -0.439849  0.216992
Ohio    0.561017 -0.114838 -0.643475
Texas   0.527696 -0.762339  0.409110
Oregon  0.171292 -0.874063 -1.605013

In [17]:
np.abs(frame)

               b         d         e
Utah    0.308471  0.439849  0.216992
Ohio    0.561017  0.114838  0.643475
Texas   0.527696  0.762339  0.409110
Oregon  0.171292  0.874063  1.605013

In [18]:
# apply a function on one dimensional arrays to each column
f = lambda x: x.max() - x.min()

In [19]:
frame

               b         d         e
Utah   -0.308471 -0.439849  0.216992
Ohio    0.561017 -0.114838 -0.643475
Texas   0.527696 -0.762339  0.409110
Oregon  0.171292 -0.874063 -1.605013

In [20]:
frame.apply(f)

b    0.869488
d    0.759225
e    2.014123
dtype: float64

In [21]:
# pass axis='columns' applies the function to each row
frame.apply(f, axis='columns')

Utah      0.656842
Ohio      1.204491
Texas     1.290035
Oregon    1.776305
dtype: float64

In [22]:
# the apply function can return a Series of values
def f(x):
    return pd.Series([x.min(), x.max()], index=['min', 'max'])

In [23]:
frame.apply(f)

            b         d         e
min -0.308471 -0.874063 -1.605013
max  0.561017 -0.114838  0.409110

In [24]:
# sorting values in a frame
frame = pd.DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})

In [25]:
frame

   b  a
0  4  0
1  7  1
2 -3  0
3  2  1

In [26]:
frame.sort_values(by='b')

   b  a
2 -3  0
3  2  1
0  4  0
1  7  1

In [27]:
# ranking a DataFrame
frame = pd.DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                      'c': [-2, 5, 8, -2.5]})

In [28]:
frame

     b  a    c
0  4.3  0 -2.0
1  7.0  1  5.0
2 -3.0  0  8.0
3  2.0  1 -2.5

In [29]:
# default tie-break is arithmetic mean
# rank for each column
frame.rank()

     b    a    c
0  3.0  1.5  2.0
1  4.0  3.5  3.0
2  1.0  1.5  4.0
3  2.0  3.5  1.0

In [30]:
# rank each row
frame.rank(axis='columns')

     b    a    c
0  3.0  2.0  1.0
1  3.0  1.0  2.0
2  1.0  2.0  3.0
3  3.0  2.0  1.0

In [31]:
# duplicate indices (axis labels)
df = pd.DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])

In [32]:
df

          0         1         2
a -0.484693 -0.092372 -0.410623
a  1.121622 -0.624322 -1.188219
b  0.791180  0.763176 -0.422562
b -0.026542 -0.852684 -0.271347

In [33]:
df.loc['b']

          0         1         2
b  0.791180  0.763176 -0.422562
b -0.026542 -0.852684 -0.271347

In [34]:
# summary stats functions
df = pd.DataFrame([[1.4, np.nan], [7.1, -4.5],
                   [np.nan, np.nan], [0.75, -1.3]],
                  index=['a', 'b', 'c', 'd'],
                  columns=['one', 'two'])

In [35]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [36]:
# compute column sums
df.sum()

one    9.25
two   -5.80
dtype: float64

In [37]:
df.sum(axis='columns')

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [38]:
# NA values are excluded unless the whole row or column is NA
df.mean(axis=1)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [39]:
# consider NA's
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [40]:
# an example reading stock data
import pandas_datareader.data as web

ModuleNotFoundError: No module named 'pandas_datareader'

In [ ]:
all_data = {ticker: web.get_data_yahoo(ticker)
            for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']}

In [ ]:
price = pd.DataFrame({ticker: data['Adj Close']
                     for ticker, data in all_data.items()})

In [ ]:
price

In [ ]:
volume = pd.DataFrame({ticker: data['Volume']
                      for ticker, data in all_data.items()})

In [ ]:
volume

In [ ]:
# compute percent changes in prices - a time series operation
returns = price.pct_change()

In [ ]:
returns.tail()

In [ ]:
# compute correlation between two series
returns['MSFT'].corr(returns['AAPL'])

In [ ]:
# covariance and different way to address the columns (must be valid Python variable names)
returns.MSFT.cov(returns.IBM)

In [ ]:
# correlation on a Data Frame

In [ ]:
returns.corr()

In [ ]:
# info about the values in a series
obj = pd.Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [ ]:
uniques = obj.unique()

In [ ]:
uniques

In [ ]:
obj.value_counts()

In [ ]:
# membership
obj

In [ ]:
mask = obj.isin(['b', 'c'])

In [ ]:
mask

In [ ]:
obj[mask]

### Related to isin is the Index.get_indexer method, which gives you an index array from an array of possibly non-distinct values into another array of distinct values

In [41]:
to_match = pd.Series(['c', 'a', 'b', 'b', 'c', 'a'])

In [42]:
unique_vals = pd.Series(['c', 'b', 'a'])

In [43]:
pd.Index(unique_vals).get_indexer(to_match)

array([0, 2, 1, 1, 0, 2])

In [44]:
# how many times does a value appear in a DataFrame?
data = pd.DataFrame({'Quiz1': ['A', 'C', 'D', 'C', 'D'],
                     'Quiz2': ['B', 'C', 'A', 'B', 'C'],
                     'Quiz3': ['A', 'F', 'B', 'D', 'D']})

In [45]:
data

  Quiz1 Quiz2 Quiz3
0     A     B     A
1     C     C     F
2     D     A     B
3     C     B     D
4     D     C     D

In [46]:
result = data.apply(pd.value_counts).fillna(0)

In [47]:
result

   Quiz1  Quiz2  Quiz3
A    1.0    1.0    1.0
B    0.0    2.0    1.0
C    2.0    2.0    0.0
D    2.0    0.0    2.0
F    0.0    0.0    1.0

In [48]:
frame = pd.DataFrame(np.random.randn(4, 4), columns=['one', 'two', 'three', 'four'],
                     index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [49]:
frame

             one       two     three      four
Utah    1.424028  0.376660  1.471721 -0.532317
Ohio    1.177800  0.702002 -0.466684  1.381875
Texas   0.357478  0.740049 -0.529325  0.935311
Oregon  0.481877  0.278212  0.801415  0.673578

In [50]:
df = frame

In [51]:
df.drop(['Utah', 'Texas'])

             one       two     three      four
Ohio    1.177800  0.702002 -0.466684  1.381875
Oregon  0.481877  0.278212  0.801415  0.673578

In [52]:
df.drop('two')

KeyError: "['two'] not found in axis"

In [ ]:
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})

In [ ]:
s1

In [ ]:
s2

In [ ]:
s2[1]

In [ ]:
s2.iteritems()

In [ ]:
s2.append(s1)

In [ ]:
frame = pd.DataFrame({'gre score': [7,4,6,2,4], 'toefl score': [118,107,104,110,103]})

In [ ]:
frame

In [ ]:
df = frame

In [ ]:
df[df['toefl score'].gt(105) & df['toefl score'].lt(115)]

In [ ]:
(df['toefl score'] > 105) & (df['toefl score'] < 115)